export const errorMessages = {
  wrongLoginDataError: "Вы ввели неправильный логин или пароль.",
  wrongTokenError:
    "При авторизации произошла ошибка. Токен не передан или передан не в том формате.",
  tokenAuthError:
    "При авторизации произошла ошибка. Переданный токен некорректен.",
  emailAlreadyExistsError: "Пользователь с таким email уже существует.",
  signupError: "При регистрации пользователя произошла ошибка.",
  profileUpdateError: "При обновлении профиля произошла ошибка.",
  serverError: "На сервере произошла ошибка.",
  pageNotFoundError: "Страница по указанному маршруту не найдена.",
  searchFieldIsEmpty: "Нужно ввести ключевое слово.",
  nothingIsFound: "Ничего не найдено.",
  searchError: "Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз."
};
